IDEA StatiCa Open Model
CheckSectionExtreme Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Check section extreme base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckSectionExtreme
 IdeaRS.OpenModel.Concrete.StagedCheckSectionExtreme
 IdeaRS.OpenModel.Concrete.StandardCheckSectionExtreme
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public abstract class CheckSectionExtreme
Public MustInherit Class CheckSectionExtreme
public ref class CheckSectionExtreme abstract
The CheckSectionExtreme type exposes the following members.
Constructors
Name | Description
CheckSectionExtreme
 Constructor
Top
Properties
Name | Description
Accidental
 Accidental loading
Fatigue
 Quasi-Permanent loading
Frequent
 Frequent loading
Fundamental
 Fundamental loading
Characteristic
 Characterictic loading
QuasiPermanent
 Quasi-Permanent loading
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace